# Parameters
nc: 10 # number of classes
scales: 
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024] 

# HSCNet backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 3, HSFC, [128]]
  - [-1, 1, Down, [256]] 
  - [-1, 6, HSFC, [256]]
  - [-1, 1, Down, [512]] 
  - [-1, 6, HSFC, [512]]
  - [-1, 1, SPPF, [512, 5]]

# HSCNet head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 3, C2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] 
  - [-1, 3, C2f, [128]] 

  - [-1, 1, Down, [256]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Down, [512]]
  - [[-1, 7], 1, Concat, [1]] 
  - [-1, 3, C2f, [512]]

  - [[16, 19], 1, Detect, [nc]]
